## Pandas
pandas is a software library written for the Python programming language for data manipulation and analysis. In particular, it offers data structures and operations for manipulating numerical tables and time series.

In [1]:
import pandas as pd
import numpy as np

In [3]:
# Creating Dataframe
df = pd.DataFrame(data = np.arange(0,20).reshape(4,5),
                  index = ['row1','rpw2','row3','row4'],
                  columns = ["col1","col2","col3","col4","col5"])

df

      col1  col2  col3  col4  col5
row1     0     1     2     3     4
rpw2     5     6     7     8     9
row3    10    11    12    13    14
row4    15    16    17    18    19

In [4]:
df.head(3)

      col1  col2  col3  col4  col5
row1     0     1     2     3     4
rpw2     5     6     7     8     9
row3    10    11    12    13    14

In [5]:
df.tail(2)

      col1  col2  col3  col4  col5
row3    10    11    12    13    14
row4    15    16    17    18    19

In [6]:
# describr whole dataframe
df.describe()

            col1       col2       col3       col4       col5
count   4.000000   4.000000   4.000000   4.000000   4.000000
mean    7.500000   8.500000   9.500000  10.500000  11.500000
std     6.454972   6.454972   6.454972   6.454972   6.454972
min     0.000000   1.000000   2.000000   3.000000   4.000000
25%     3.750000   4.750000   5.750000   6.750000   7.750000
50%     7.500000   8.500000   9.500000  10.500000  11.500000
75%    11.250000  12.250000  13.250000  14.250000  15.250000
max    15.000000  16.000000  17.000000  18.000000  19.000000

In [10]:
# describe particular column
df['col1'].describe()

count     4.000000
mean      7.500000
std       6.454972
min       0.000000
25%       3.750000
50%       7.500000
75%      11.250000
max      15.000000
Name: col1, dtype: float64

In [12]:
# Get column in Series format
# Series: Data that contain row names but not the column Name
type(df['col1'])

pandas.core.series.Series

In [13]:
# Get column in dataframe format
# DataFrame: Data that contain row and column names
type(df[['col1']])

pandas.core.frame.DataFrame

In [15]:
# get data on the basis of row 
df.loc[['row1','row3']]

      col1  col2  col3  col4  col5
row1     0     1     2     3     4
row3    10    11    12    13    14

In [17]:
# get data on the basis of row index and column index
df.iloc[0:3] # get all the columns with selected row index

      col1  col2  col3  col4  col5
row1     0     1     2     3     4
rpw2     5     6     7     8     9
row3    10    11    12    13    14

In [18]:
# Get data from selected rows and columns
df.iloc[0:3,1:3]

      col2  col3
row1     1     2
rpw2     6     7
row3    11    12

In [20]:

# Example:
# Get elemtns 12,13,17,18
df.iloc[2:4, 2:4]

      col3  col4
row3    12    13
row4    17    18

In [ ]:
# get series data using loc()

In [23]:
# Creating new DatFrame
df2 = pd.DataFrame(data = [[1,np.nan,2],[3,4,5],[6,7,8]],
                    index = ['row1','row2','row3'],
                    columns = ['col1','col2','col3'])

df2

      col1  col2  col3
row1     1   NaN     2
row2     3   4.0     5
row3     6   7.0     8

In [30]:
# get null values from dataframe
df2.isnull()
# OR
df2.isna()

       col1   col2   col3
row1  False   True  False
row2  False  False  False
row3  False  False  False
       col1   col2   col3
row1  False   True  False
row2  False  False  False
row3  False  False  False

In [31]:
# get the count of null values in all columns
df2.isnull().sum()

# OR

df2.isna().sum()

col1    0
col2    1
col3    0
dtype: int64

In [32]:
# get information about datatype
df2.info()

<class 'pandas.core.frame.DataFrame'>
Index: 3 entries, row1 to row3
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   col1    3 non-null      int64
 1   col2    2 non-null      float64
 2   col3    3 non-null      int64
dtypes: float64(1), int64(2)
memory usage: 96.0+ bytes

In [36]:
# get unique values in a column
df2['col1'].unique()

array([1, 3, 6], dtype=int64)

In [34]:
# get the count of unique values in a column
df2['col1'].value_counts()

# NOTE: value_counnts() will only work with series and string data

col1
1    1
3    1
6    1
Name: count, dtype: int64

In [38]:
# get unique values in all the columns in DF
df2.nunique()

col1    3
col2    2
col3    3
dtype: int64

In [39]:
# count of unique values in all rows
df2.nunique(axis=1)

row1    2
row2    3
row3    3
dtype: int64

### Filter on data

In [42]:
df

      col1  col2  col3  col4  col5
row1     0     1     2     3     4
rpw2     5     6     7     8     9
row3    10    11    12    13    14
row4    15    16    17    18    19

In [44]:
# condition
df['col3'] > 10

row1    False
rpw2    False
row3     True
row4     True
Name: col3, dtype: bool

In [46]:
# condition
df[df['col3'] > 10]

      col1  col2  col3  col4  col5
row3    10    11    12    13    14
row4    15    16    17    18    19

In [51]:
# save the df as csv file
df.to_csv('test.csv',sep=',', index=False)

In [53]:
# read saved csv
demo_df = pd.read_csv('test.csv')

demo_df

   col1  col2  col3  col4  col5
0     0     1     2     3     4
1     5     6     7     8     9
2    10    11    12    13    14
3    15    16    17    18    19

In [55]:
# save dataframe as excel file
# df.to_excel('test_excel.xlsx')

In [66]:
data = '{"employee_name": "Kashyap","email": "kpkolhe1998@gmail.com","job_profile": [{"title":"Data Enngineer", "role":"Developer","salary":100}]}'

In [68]:
json_df = pd.read_json(data)

In [71]:
# the json data can be read in different format
pd.read_json(data, orient = 'record')

# OR

pd.read_json(data, orient = 'column')

,employee_name,email,job_profile
0,Kashyap,kpkolhe1998@gmail.com,"{'title': 'Data Enngineer', 'role': 'Developer..."

In [74]:
pd.read_json(data, orient='index')

                                                               0
employee_name                                            Kashyap
email                                      kpkolhe1998@gmail.com
job_profile    [{'title': 'Data Enngineer', 'role': 'Develope...

In [79]:
# save data in the json format with orientation with 'index'
json_df.to_json("json_data",orient='index')